full_name = "Долгих Кира Денисовна"
date = "12.02.2026"
experiment_title = "Исследование памяти студентов"
conclusion = "Вывод:\nВ ходе эксперимента выявлены нарушения долговременной памяти у экспериментальной группы животных."

entry = f"""
 {full_name}
 {date}
 -------------------------------------------------------------------
 Эксперимент: {experiment_title}
 
 {conclusion}
 
 -------------------------------------------------------------------
 """


def main():
 full_name = input("Введите дату эксперимента:")
 date = input("Введите дату эксперимента:")
 experiment_title = input("Введите название эксперимента:")
 conclusion = input("Введите вывод по эксперименту:")

 with open('journal.txt', 'w', encoding='utf-8') as file: 
    file.write("Электронный лабораторный журнал")
print("Запись успешно сохранена в файл journal.Txt")

if __name__ == "__main__":
 main()